{
	"type": "template",
	"title": "Document project",
	"items": [
		{
			"type": "section_container",
			"key": "metadata_information",
			"title": "Metadata information",
			"class": "mandatory recommended",
			"expanded": true,
			"items": [
				{
					"key": "metadata_information.idno",
					"type": "text",
					"class": "idno",
					"title": "Unique ID of the metadata file",
					"help_text": "A unique identifier for the metadata document (unique in the catalog; ideally also unique globally). This is different from the document unique identifier in the \"Document description / Title and identifiers\" section, although it is good practice to generate identifiers that establish a clear connection between the metadata IDNO and the document IDNO. For example, if the unique identifier of the document is “978-1-4648-1342-9”, the identifier used in this element could be “IHSN_978-1-4648-1342-9” if the metadata are generated by the IHSN. "
				},
				{
					"key": "metadata_information.title",
					"type": "text",
					"title": "Title"
				},
				{
					"key": "metadata_information.producers",
					"class": "required",
					"title": "Producer of the metadata",
					"type": "array",
					"props": [
						{
							"key": "name",
							"title": "Name",
							"type": "text",
							"help_text": "Name (required)",
							"class": "required",
							"prop_key": "metadata_information.producers.name"
						},
						{
							"key": "abbr",
							"title": "Abbreviation",
							"type": "text",
							"prop_key": "metadata_information.producers.abbreviation"
						},
						{
							"key": "affiliation",
							"type": "string",
							"title": "Affiliation",
							"prop_key": "metadata_information.producers.affiliation"
						},
						{
							"key": "role",
							"title": "Role",
							"type": "string",
							"prop_key": "metadata_information.producers.role"
						}
					],
					"help_text": "This element refers to the producer(s) of the metadata, not to the producer(s) of the document itself. It includes four sub-elements.\n\n- Name: The name of the metadata producer/curator. An alternative to entering the name of the curator (e.g. for privacy protection purpose) is to enter the curator identification number in \"Abbreviation\".\n- Abbreviation: An abbreviation of the name, which can be used to provide an identifier of the metadata producer/curator or the acronym of the organization if the name of an organization was entered in the element \"Name\".\n- Affiliation: The affiliation of the metadata producer/curator.\n- Role: The specific role of the person or organization mentioned in name in the production of the metadata for the document."
				},
				{
					"key": "metadata_information.production_date",
					"type": "text",
					"class": "required",
					"title": "Date of production",
					"help_text": "The date the metadata (not the resource being documented) was produced. It is recommended to enter the date in ISO format: YYYY-MM-DD."
				},
				{
					"key": "metadata_information.version",
					"type": "text",
					"class": "required",
					"title": "Version of the metadata file",
					"help_text": "The version of the metadata (not the version of the publication or report itself)."
				},
				{
					"key": "metadata_information1673448755515",
					"title": "Untitled",
					"type": "section",
					"items": [
						{
							"key": "metadata_information.title",
							"type": "text",
							"title": "Title"
						}
					],
					"help_text": ""
				}
			]
		},
		{
			"type": "section_container",
			"key": "document",
			"title": "Document description",
			"class": "mandatory recommended",
			"expanded": true,
			"items": [
				{
					"type": "section",
					"key": "title_statement",
					"title": "Title and identifiers",
					"class": "recommended",
					"items": [
						{
							"key": "document_description.title_statement.idno",
							"title": "Unique identifier",
							"help_text": "A unique identifier to the document. Do not include spaces in the identifier. This is the identifier used in the primary catalog or repository where the document is intended to be published. This identifier must therefore be unique to the catalog in which the document will be published. Some organizations have their own system to assign unique identifiers to documents. Ideally, an identifier that guarantees uniqueness globally will be used, such as a Digital Object Identifier (DOI) or an ISBN number. Note that a document may have more than one identifier. The other identifiers will be provided in the element \"Other identifiers\".",
							"type": "text",
							"class": "required",
							"_rules": "required|idno|alpha_dash|min:5|max:80",
							"required": true,
							"is_required": true
						},
						{
							"key": "document_description.title_statement.title",
							"title": "Title",
							"type": "text",
							"class": "required",
							"required": true,
							"_rules": "required|max:300",
							"name": "title",
							"is_required": true,
							"help_text": "The title of the book, report, paper, or other document. Pay attention to the use of capitalization in the title, to ensure consistency across documents listed in your catalog. It is recommended to use sentence capitalization. "
						},
						{
							"key": "document_description.title_statement.sub_title",
							"title": "Subtitle",
							"type": "text",
							"_rules": "max:300",
							"help_text": "The sub-title of the book, report, paper, or other document, if any. It is recommended to use sentence capitalization. "
						},
						{
							"key": "document_description.title_statement.alternate_title",
							"title": "Alternate title",
							"type": "text",
							"help_text": "An alternate version of the title, possibly an abbreviated version. For example, the World Bank’s World Development Report is often referred to as the WDR; the alternate title for the “World Development Report 2021” could then be “WDR 2021”."
						},
						{
							"key": "document_description.title_statement.abbreviated_title",
							"title": "Translated title",
							"help_text": "A translation of the title of the document.",
							"type": "text"
						},
						{
							"key": "document_description.identifiers",
							"title": "Other identifiers",
							"type": "array",
							"help_text": "This element is used to enter document identifiers (IDs) other than the ID entered in the \"Unique identifier\" field. It can for example be a Digital Object Identifier (DOI), an International Standard Book Number (ISBN), or an International Standard Serial Number (ISSN). The element has two sub-elements:\n- TYPE: The type of unique ID, e.g. “DOI”, “ISBN”, or “ISSN”.\n- IDENTIFIER: The identifier itself.\nThe ID entered in the \"Unique identifier\" can be repeated here (the \"Unique identifier\" element does not provide a \"type\" parameter; if a DOI, ISBN, ISSN, or other standard reference ID is used as idno, it is recommended to repeat it here with the identification of its type). ",
							"props": [
								{
									"key": "type",
									"title": "ID Type",
									"type": "text",
									"help_text": "Identifiers such as ISSN, ISBN, DOI"
								},
								{
									"key": "identifier",
									"title": "Identifier",
									"type": "text"
								}
							]
						}
					]
				},
				{
					"type": "section",
					"key": "date_info",
					"title": "Dates ",
					"class": "recommended",
					"items": [
						{
							"key": "document_description.date_created",
							"title": "Date created",
							"type": "text",
							"class": "recommended",
							"help_text": "The date, entered in ISO format (YYYY-MM-DD or YYYY-MM or YYYY), when the document was produced. This can be different from the date the document was published, made available, and from the temporal coverage. ",
							"is_recommended": false
						},
						{
							"key": "document_description.date_published",
							"title": "Date published",
							"type": "text",
							"class": "recommended",
							"help_text": "The date, entered in ISO format (YYYY-MM-DD or YYYY-MM or YYYY), when the document was published.",
							"is_recommended": true
						},
						{
							"key": "document_description.date_modified",
							"title": "Date last modified",
							"type": "text",
							"class": "recommended",
							"help_text": "The date, entered in ISO format (YYYY-MM-DD or YYYY-MM or YYYY), when the document was last modified."
						},
						{
							"key": "document_description.date_available",
							"title": "Date available",
							"type": "text",
							"class": "recommended",
							"help_text": "The date, entered in ISO format (YYYY-MM-DD or YYYY-MM or YYYY), when the document was made available. This is different from the date it was published. This element will not be used frequently."
						}
					]
				},
				{
					"type": "section",
					"key": "authors",
					"title": "Authors and contributors",
					"class": "recommended",
					"items": [
						{
							"key": "document_description.authors",
							"title": "Authors",
							"help_text": "The authors should be listed in the same order as they appear in the source itself, which is not necessarily alphabetical.\n- First name: The first name of the author.\n- Initial: The initials of the author.\n- Last name: The last name of the author.\n- Affiliation: The affiliation of the author.\n",
							"type": "array",
							"props": [
								{
									"key": "first_name",
									"title": "First Name",
									"type": "text",
									"help_text": "First name"
								},
								{
									"key": "initial",
									"title": "Initial",
									"type": "text",
									"help_text": "Name initial"
								},
								{
									"key": "last_name",
									"title": "Last name",
									"type": "text",
									"help_text": "Last name"
								},
								{
									"key": "affiliation",
									"title": "Affiliation",
									"type": "text"
								}
							],
							"is_recommended": true
						},
						{
							"key": "document_description.editors",
							"title": "Editors",
							"help_text": "If the source is a text within an edited volume, it should be listed under the name of the author of the text used, not under the name of the editor. The name of the editor should however be provided in the bibliographic citation, in accordance with a reference style. The element has four sub-elements: first name of the editor, initials of the editor, last name of the editor, and affiliation of the editor.\n- First name: The first name of the editor.\n- Initial: The initials of the editor.\n- Last name: The last name of the editor.\n- Affiliation: The affiliation of the editor.",
							"type": "array",
							"props": [
								{
									"key": "first_name",
									"title": "First Name",
									"type": "text",
									"help_text": "First name"
								},
								{
									"key": "initial",
									"title": "Initial",
									"type": "text",
									"help_text": "Name initial"
								},
								{
									"key": "last_name",
									"title": "Last name",
									"type": "text",
									"help_text": "Last name"
								},
								{
									"key": "affiliation",
									"title": "Affiliation",
									"type": "text"
								}
							]
						},
						{
							"key": "document_description.translators",
							"title": "Translators",
							"help_text": "Information on translators, for publications that are translations of publication originally created in another language.\n- First name: The first name of the translator.\n- Initial: The initials of the translator.\n- Last name: The last name of the translator.\n- Affiliation: The affiliation of the translator.",
							"type": "array",
							"props": [
								{
									"key": "first_name",
									"title": "First Name",
									"type": "text",
									"help_text": "First name"
								},
								{
									"key": "initial",
									"title": "Initial",
									"type": "text",
									"help_text": "Name initial"
								},
								{
									"key": "last_name",
									"title": "Last name",
									"type": "text",
									"help_text": "Last name"
								},
								{
									"key": "affiliation",
									"title": "Affiliation",
									"type": "text"
								}
							]
						},
						{
							"key": "document_description.contributors",
							"title": "Other contributors",
							"help_text": "These elements are used to acknowledge contributions to the production of the document, other than the ones for which specific metadata elements are provided (like authors or translators).\n- First name: The first name of the contributor.\n- Initial: The initials of the contributor.\n- Last name: The last name of the contributor. If the contributor is an organization, enter the name of the organization here.\n- Affiliation: The affiliation of the contributor.\n- Contribution: A brief description of the specific contribution of the person to the document, e.g. “Design of the cover page”, or “Proofreading”.",
							"type": "array",
							"props": [
								{
									"key": "first_name",
									"title": "First Name",
									"type": "text",
									"help_text": "First name"
								},
								{
									"key": "initial",
									"title": "Initial",
									"type": "text",
									"help_text": "Name initial"
								},
								{
									"key": "last_name",
									"title": "Last name",
									"type": "text",
									"help_text": "Last name"
								},
								{
									"key": "affiliation",
									"title": "Affiliation",
									"type": "text"
								}
							]
						}
					]
				},
				{
					"key": "document1673376374410",
					"title": "Bibliographic information",
					"type": "section",
					"items": [
						{
							"key": "document_description.bibliographic_citation",
							"title": "Bibliographic citation",
							"type": "array",
							"props": [
								{
									"key": "style",
									"title": "Citation style",
									"type": "text",
									"help_text": "Citation style e.g. APA"
								},
								{
									"key": "citation",
									"title": "Citation",
									"type": "textarea"
								}
							],
							"help_text": "The bibliographic citation provides relevant information about the author and the publication. When using the element \"Bibliographic citation\", the citation is provided as a single item. It should be provided in a standard style: Modern Language Association (MLA), American Psychological Association (APA), or Chicago. \n- Style: The citation style, e.g. “MLA”, “APA”, or “Chicago”.\n- Citation: The citation entered in the style mentioned in \"Style\".\nNote that the template also provides an itemized list of all elements (BibTex fields) required to build a citation in a format of their choice."
						},
						{
							"key": "document_description.booktitle",
							"title": "Book title",
							"type": "text",
							"help_text": "Title of a book, part of which is being cited. If you are documenting the book itself, this element will not be used; it is only used when part of a book is being documented."
						},
						{
							"key": "document_description.chapter",
							"title": "Chapter number",
							"type": "text",
							"help_text": "A chapter (or section) number. This element is only used to document a resource which has been extracted from a book."
						},
						{
							"key": "document_description.edition",
							"title": "Edition",
							"type": "text",
							"help_text": "The edition of a book - for example “Second”. When a book has no edition number/name present, it can be assumed to be a first edition. If the edition is other than the first, information on the edition of the book being documented must be mentioned in the citation. The edition can be identified by a number, a label (such as “Revised edition” or “Abridged edition”), and/or a year. The first letter of the label should be capitalized."
						},
						{
							"key": "document_description.institution",
							"title": "Institution name",
							"type": "text",
							"help_text": "The sponsoring institution of a technical report. For citations of Master’s and Ph.D. thesis, this will be the name of the school."
						},
						{
							"key": "document_description.journal",
							"title": "Journal name",
							"type": "text",
							"help_text": "A journal name. Abbreviations are provided for many journals."
						},
						{
							"key": "document_description.volume",
							"title": "Volume",
							"type": "text",
							"help_text": "The volume of a journal or multi-volume book. Periodical publications, such as scholarly journals, are published on a regular basis in installments that are called issues. A volume usually consists of the issues published during one year."
						},
						{
							"key": "document_description.number",
							"title": "Number",
							"type": "text",
							"help_text": "The number of a journal, magazine, technical report, or of a work in a series. An issue of a journal or magazine is usually identified by its volume (see previous element) and number; the organization that issues a technical report usually gives it a number; and sometimes books are given numbers in a named series."
						},
						{
							"key": "document_description.pages",
							"title": "Pages",
							"type": "text",
							"help_text": "One or more page numbers or range of numbers, such as 42-111 or 7,41,73-97 or 43+ (the `+’ indicates pages following that don’t form a simple range)."
						},
						{
							"key": "document_description.publisher",
							"title": "Publisher name",
							"type": "text",
							"help_text": "The entity responsible for making the resource available. For major publishing houses, the information can be omitted. For small publishers, providing the complete address is recommended. If the company is a university press, the abbreviation UP (for University Press) can be used. The publisher is not stated for journal articles, working papers, and similar types of documents."
						},
						{
							"key": "document_description.publisher_addres",
							"title": "Publisher address",
							"type": "text",
							"help_text": "The address of the publisher. For major publishing houses, just the city is given. For small publishers, the complete address can be provided."
						},
						{
							"key": "document_description.series",
							"title": "Series name",
							"type": "text",
							"class": "recommended",
							"help_text": "The name of a series or set of books. When citing an entire book, the title field gives its title and an optional series field gives the name of a series or multi-volume set in which the book is published."
						},
						{
							"key": "document_description.crossref",
							"title": "Cross reference",
							"type": "text",
							"help_text": "The catalog identifier (“database key”) of another catalog entry being cross referenced. This element may be used when multiple entries refer to a same publication, to avoid duplication."
						},
						{
							"key": "document_description.key",
							"title": "Key",
							"type": "text",
							"help_text": "A key is a field used for alphabetizing, cross referencing, and creating a label when the `author’ information is missing."
						},
						{
							"key": "document_description.organization",
							"title": "Organization",
							"type": "text",
							"help_text": "The organization that sponsors a conference or that publishes a manual."
						},
						{
							"key": "document_description.publication_frequency",
							"title": "Publication frequency",
							"type": "text",
							"help_text": "Some documents are published regularly. The frequency of publications can be documented using this element. It is recommended to use a controlled vocabulary, for example the PRISM Publishing Frequency Vocabulary which identifies standard publishing frequencies for a serial or periodical publication.",
							"enum": [
								{
									"value": "annually"
								},
								{
									"value": "semiannually"
								},
								{
									"value": "quarterly"
								},
								{
									"value": "bimonthly"
								},
								{
									"value": "monthly"
								},
								{
									"value": "biweekly"
								},
								{
									"value": "weekly"
								},
								{
									"value": "daily"
								},
								{
									"value": "continually"
								},
								{
									"value": "irregularly"
								},
								{
									"value": "other"
								}
							]
						},
						{
							"key": "document_description.annote",
							"title": "Annotation",
							"type": "text",
							"help_text": "An annotation. This element will not be used by standard bibliography styles like the MLA, APA or Chicago, but may be used by others that produce an annotated bibliography."
						},
						{
							"key": "document_description.howpublished",
							"title": "How published",
							"type": "text",
							"help_text": "The howpublished element is used to store the notice for unusual publications. The first word should be capitalized. For example, “WebPage”, or “Distributed at the local tourist office”."
						},
						{
							"key": "document_description.url",
							"title": "URL",
							"type": "text",
							"help_text": "The URL of the document, preferably a permanent URL."
						}
					],
					"help_text": ""
				},
				{
					"type": "section",
					"key": "document_description",
					"title": "Content description",
					"class": "recommended",
					"items": [
						{
							"key": "document_description.type",
							"title": "Document type",
							"type": "dropdown",
							"enum": [
								{
									"value": "article"
								},
								{
									"value": "book"
								},
								{
									"value": "booklet"
								},
								{
									"value": "collection"
								},
								{
									"value": "conference_proceedings"
								},
								{
									"value": "manual"
								},
								{
									"value": "master_thesis"
								},
								{
									"value": "patent"
								},
								{
									"value": "phd_thesis"
								},
								{
									"value": "proceedings"
								},
								{
									"value": "technical_report"
								},
								{
									"value": "working_paper"
								},
								{
									"value": "website"
								},
								{
									"value": "other"
								}
							],
							"help_text": "This describes the nature of the resource. It is recommended practice to select a value from the controlled vocabulary. ",
							"is_recommended": true
						},
						{
							"key": "document_description.languages",
							"title": "Language",
							"help_text": "The language(s) in which the document is written. The use of ISO 639-2 (the alpha-3 code in Codes for the representation of names of languages) is recommended. \nThis is a block of two elements (at least one must be provided for each language):\n- Language name: The name of the language.\n- Language code: The code of the language. ",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Language Name",
									"type": "text",
									"help_text": "Language name"
								},
								{
									"key": "code",
									"title": "Language code",
									"type": "text",
									"help_text": "Language code"
								}
							],
							"is_recommended": true
						},
						{
							"key": "document_description.description",
							"title": "Description",
							"type": "textarea",
							"class": "recommended",
							"help_text": "This element is used to provide a brief description of the document (not an abstract, which would be provided in the field \"abstract\"). It should not be used to provide content that is contained in other, more specific elements. Best practice recommendation for this element is to use full sentences, as description is often used to present information to users to assist in their selection of appropriate resources from a set of search results."
						},
						{
							"key": "document_description.abstract",
							"title": "Abstract",
							"type": "textarea",
							"help_text": "The abstract is a summary of the document, usually about one or two paragraph(s) long (around 150 to 300 words).",
							"is_recommended": true
						},
						{
							"key": "document_description.scope",
							"title": "Scope",
							"help_text": "A textual description of topics covered in the document, which complements (not duplicates) the elements \"Description\" and \"Topics\".",
							"type": "textarea"
						},
						{
							"key": "document_description.keywords",
							"type": "array",
							"title": "Keywords",
							"props": [
								{
									"key": "name",
									"title": "Keyword",
									"type": "text"
								},
								{
									"key": "vocabulary",
									"title": "Vocabulary",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								}
							],
							"help_text": "A list of keywords that provide information on the core content of the document. Keywords provide a convenient solution to improve the discoverability of the document, as it allows terms and phrases not found in the document itself to be indexed and to make a document discoverable by text-based search engines. A controlled vocabulary will preferably be used (although not required), such as the UNESCO Thesaurus. The list provided here can combine keywords from multiple controlled vocabularies, and user-defined keywords.\n- Keyword: The keyword itself.\n- Vocabulary: The controlled vocabulary (including version number or date) from which the keyword is extracted, if any.\n- URL: The URL of the controlled vocabulary from which the keyword is extracted, if any."
						},
						{
							"key": "document_description.topics",
							"type": "array",
							"title": "Topics",
							"props": [
								{
									"key": "id",
									"title": "ID",
									"type": "text"
								},
								{
									"key": "name",
									"title": "Topic",
									"type": "text"
								},
								{
									"key": "parent_id",
									"title": "Parent topic Identifier",
									"help_text": "For subtopics, provide the ID of the parent topic",
									"type": "text"
								},
								{
									"key": "vocabulary",
									"title": "Vocabulary",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								}
							],
							"help_text": "Information on the topics covered in the document. A controlled vocabulary will preferably be used, for example the CESSDA Topics classification, a typology of topics available in 11 languages; or the Journal of Economic Literature (JEL) Classification System, or the World Bank topics classification. Note that you may use more than one controlled vocabulary. This element is a block of five fields:\n- ID: The ID of the topic, taken from a controlled vocabulary.\n- Topic: The name (label) of the topic, preferably taken from a controlled vocabulary.\n- Parent ID: The parent ID of the topic(ID of the item one level up in the hierarchy), if a hierarchical controlled vocabulary is used.\n- Vocabulary: The name (including version number) of the controlled vocabulary used, if any.\n- URL: The URL to the controlled vocabulary used, if any."
						},
						{
							"key": "document_description.themes",
							"type": "array",
							"title": "Themes",
							"props": [
								{
									"key": "name",
									"title": "Theme",
									"type": "text"
								},
								{
									"key": "vocabulary",
									"title": "Vocabulary",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								}
							],
							"help_text": "A list of themes covered by the document. A controlled vocabulary will preferably be used. Note that themes will rarely be used as the elements topics and disciplines are more appropriate for most uses. This is a block of five fields:\n- ID: The ID of the theme, taken from a controlled vocabulary.\n- Theme: The name (label) of the theme, preferably taken from a controlled vocabulary.\n- Parent ID: The parent ID of the theme (ID of the item one level up in the hierarchy), if a hierarchical controlled vocabulary is used.\n- Vocabulary: The name (including version number) of the controlled vocabulary used, if any.\n- URL: The URL to the controlled vocabulary used, if any."
						},
						{
							"key": "document_description.disciplines",
							"type": "array",
							"title": "Disciplines",
							"props": [
								{
									"key": "name",
									"title": "Name",
									"type": "text"
								},
								{
									"key": "vocabulary",
									"title": "Vocabulary",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								}
							],
							"help_text": "Information on the academic disciplines related to the content of the document. A controlled vocabulary will preferably be used, for example the one provided by the list of academic fields in Wikipedia. his is a block of five elements:\n- ID: The ID of the discipline, taken from a controlled vocabulary.\n- Theme: The name (label) of the discipline, preferably taken from a controlled vocabulary.\n- Parent ID: The parent ID of the discipline(ID of the item one level up in the hierarchy), if a hierarchical controlled vocabulary is used.\n- Vocabulary: The name (including version number) of the controlled vocabulary used, if any.\n- URL: The URL to the controlled vocabulary used, if any.\n"
						},
						{
							"key": "document_description.toc",
							"title": "Table of contents",
							"type": "textarea",
							"help_text": "The table of content of the document, provided as a single string element, i.e. with no structure (an structured alternative is provided with the field \"Table of content (structured)\". This element is also a rich source of indexable terms which can contribute to document discoverability; this element (or its alternative \"Table of content (structured)\" should thus be filled when possible."
						},
						{
							"key": "document_description.toc_structured",
							"title": "Table of contents (structured)",
							"type": "array",
							"props": [
								{
									"key": "id",
									"title": "ID",
									"type": "text"
								},
								{
									"key": "parent_id",
									"title": "Parent ID",
									"type": "text"
								},
								{
									"key": "name",
									"title": "Name",
									"type": "text"
								}
							],
							"help_text": "This element is used as an alternative to \"Table of content\" to provide a structured table of content. The element contains a repeatable block of three sub-elements which provides the possibility to define a hierarchical structure. It requires entering:\n- ID: A unique identifier for the element of the table of content. For example, the ID for Chapter 1 could be “1” while the ID for section 1 of chapter 1 would be “11”.\n- Parent ID: The ID of the parent section (e.g., if the TOC is divided into chapters, themselves divided into sections, the Parent ID of a section would be the ID of the chapter it belongs to).\n- Name: The label of this item of the table of content (e.g., the chapter or section title)."
						}
					]
				},
				{
					"key": "document1673376827580",
					"title": "Spatial and temporal coverage",
					"type": "section",
					"items": [
						{
							"key": "document_description.ref_country",
							"title": "Countries",
							"help_text": "The list of countries (or regions) covered by the document, if applicable. This is a repeatable block of two elements:\n- Country name: The country/region name. Note that many organizations have their own policies on the naming of countries/regions/economies/territories, which data curators will have to comply with.\n- Country code: The country/region code (entered as a string, even for numeric codes). It is recommended to use a standard list of countries and regions, such as the ISO country list (ISO 3166).\nWhen a document is related to only part of a country, we still want to capture this information in the metadata.\n\nWhen a document is related to a region (not to specific countries), or when it is related to a topic but not a specific geographic area, the \"Countries\" element  might still be applicable. Try and extract (possibly using a script that parses the document) information on the countries mentioned in the document. \n\n“World” (code WLD) can be entered if the document is related but not specific to countries (for example, a document on “Climate change mitigation”).\nIf a document is not specific to any country, the element \"Countries\" can be ignored (for example, the user’s guide of a software application). \n",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Country Name",
									"type": "text",
									"help_text": "Country name",
									"_rules": "required",
									"prop_key": "document_description.ref_country.name"
								},
								{
									"key": "code",
									"title": "Country ISO 3 code",
									"type": "text",
									"help_text": "Country ISO 3 code",
									"prop_key": "document_description.ref_country.code"
								}
							],
							"is_recommended": true
						},
						{
							"key": "document_description.geographic_units",
							"title": "Geographic areas",
							"help_text": "A list of geographic areas covered in the document, other than the countries listed in \"Countries\".\n\n- Name: The name of the geographic unit.\n- Location code: The code of the geographic unit.\n- Type: The type of the geographic area (e.g., “province”, “state”, “district”, or “town”).",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Name",
									"type": "text",
									"help_text": "Location name",
									"__rules": "required",
									"prop_key": "document_description.geographic_units.name"
								},
								{
									"key": "code",
									"title": "Location code",
									"type": "text",
									"help_text": "Code of the geographic unit (for countries, preferred = ISO3 code)",
									"prop_key": "document_description.geographic_units.code"
								},
								{
									"key": "type",
									"title": "Type",
									"type": "text",
									"help_text": "Type of geographic unit e.g. country, state, region, province, town, etc",
									"prop_key": "document_description.geographic_units.type"
								}
							]
						},
						{
							"key": "document_description.bbox",
							"title": "Bounding box",
							"type": "array",
							"props": [
								{
									"key": "west",
									"title": "West",
									"type": "text"
								},
								{
									"key": "east",
									"title": "East",
									"type": "text"
								},
								{
									"key": "south",
									"title": "South",
									"type": "text"
								},
								{
									"key": "north",
									"title": "North",
									"type": "text"
								}
							],
							"help_text": "The bounding box(es) of geographic units covered in the document. The bounding boxes are the coordinates (latitude and longitude) of rectangular geographic areas that the document covers. This element will rarely be used for documenting publications. Bounding boxes are an optional element, but when a bounding box is defined, all four coordinates are required."
						},
						{
							"key": "document_description.spatial_coverage",
							"title": "Spatial coverage",
							"type": "text",
							"help_text": "This element provides another field for capturing information on the spatial coverage of a document, which complements the \"Countries\", \"Geographic units\", and \"Bounding box\" elements. It can be used to qualify the geographic coverage of the document, in the form of a free text. "
						},
						{
							"key": "document_description.temporal_coverage",
							"title": "Temporal coverage",
							"type": "text",
							"help_text": "Not all documents have a specific time coverage. When they do, it can be specified in this element."
						}
					],
					"help_text": ""
				},
				{
					"key": "document1673376592167",
					"title": "Access and rights",
					"type": "section",
					"items": [
						{
							"key": "document_description.status",
							"title": "Status",
							"type": "text",
							"class": "recommended",
							"help_text": "The status of the document. It should be taken from the controlled vocabulary. Most documents published in a catalog will likely be \"final\".",
							"enum": [
								{
									"value": "first draft"
								},
								{
									"value": "draft"
								},
								{
									"value": "draft released for comment"
								},
								{
									"value": "reviewed draft"
								},
								{
									"value": "final draft"
								},
								{
									"value": "final"
								}
							]
						},
						{
							"key": "document_description.rights",
							"title": "Rights",
							"type": "textarea",
							"help_text": "A statement on the rights associated with the document (others than the copyright, which should be described in the element \"Copyright\")."
						},
						{
							"key": "document_description.copyright",
							"title": "Copyright",
							"type": "text",
							"help_text": "A statement and identifier indicating the legal ownership and rights regarding use and re-use of all or part of the resource. If the document is protected by a copyright, enter the information on the person or organization who owns the rights."
						},
						{
							"key": "document_description.license",
							"title": "License",
							"help_text": "Information on the license(s) attached to the document, which defines the terms of use.\n- Name: The name of the license (e.g., CC-BY 4.0).\n- The URL of the license, where detailed information on the license can be obtained.",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Name",
									"type": "text",
									"help_text": "Name"
								},
								{
									"key": "uri",
									"title": "URI",
									"type": "text",
									"help_text": "URL"
								}
							]
						},
						{
							"key": "document_description.usage_terms",
							"title": "Usage terms",
							"type": "text",
							"help_text": "This element is used to provide a description of the legal terms or other conditions that a person or organization who wants to use or reproduce the document has to comply with. "
						},
						{
							"key": "document_description.disclaimer",
							"title": "Disclaimer",
							"type": "text",
							"help_text": "A disclaimer limits the liability that the Statistics Office has regarding the use of the data. A standard legal statement should be used for all documents from a same agency."
						},
						{
							"key": "document_description.security_classification",
							"title": "Security classification",
							"type": "text",
							"help_text": "Information on the security classification attached to the document. The different levels of classification indicate the degree of sensitivity of the content of the document. The use of the controlled vocabulary is recommended (the controlled vocabulary must be specific to the organization that curates or disseminates the document). ",
							"enum": [
								{
									"value": "public"
								},
								{
									"value": "internal-only"
								},
								{
									"value": "restricted"
								},
								{
									"value": "confidential"
								}
							]
						},
						{
							"key": "document_description.access_restrictions",
							"title": "Access restrictions",
							"type": "text",
							"help_text": "A textual description of access restrictions that apply to the document."
						},
						{
							"key": "document_description.pricing",
							"title": "Pricing",
							"type": "text",
							"help_text": "The current price of the document in any defined currency. As this information is subject to regular change, it will often not be included in the document metadata."
						}
					],
					"help_text": ""
				},
				{
					"key": "document1673377443704",
					"title": "Other information",
					"type": "section",
					"items": [
						{
							"key": "document_description.contacts",
							"title": "Contacts",
							"help_text": "Contacts",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Name",
									"type": "text",
									"help_text": "name"
								},
								{
									"key": "role",
									"title": "Role",
									"type": "text",
									"help_text": "Role"
								},
								{
									"key": "affiliation",
									"title": "Affiliation",
									"type": "text"
								},
								{
									"key": "email",
									"title": "Email",
									"type": "text",
									"help_text": "Email"
								},
								{
									"key": "telephone",
									"title": "Telephone",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URI",
									"type": "text"
								}
							]
						},
						{
							"key": "document_description.notes",
							"title": "Notes",
							"type": "array",
							"props": [
								{
									"key": "note",
									"title": "Note",
									"type": "text"
								}
							],
							"help_text": "This field can be used to provide information on the document that does not belong to the other, more specific metadata elements provided in the schema."
						},
						{
							"key": "document_description.sources",
							"type": "array",
							"title": "Sources",
							"props": [
								{
									"key": "source_origin",
									"title": "Origin of source",
									"type": "text"
								},
								{
									"key": "source_char",
									"title": "Characteristics of source noted",
									"type": "text"
								},
								{
									"key": "source_doc",
									"title": "Source documentation",
									"type": "text"
								}
							],
							"help_text": "This element is used to describe the sources of different types (except data sources, which must be listed in the element \"Data sources\") that were used in the production of the document.\n- Origin of source: For historical materials, information about the origin(s) of the sources and the rules followed in establishing the sources should be specified.\n- Characteristics of source: Characteristics of the source. Assessment of characteristics and quality of source material.\n- Source documentation: Documentation and access to the source."
						},
						{
							"key": "document_description.data_sources",
							"type": "array",
							"title": "Data sources",
							"props": [
								{
									"key": "name",
									"title": "Dataset name",
									"type": "text"
								},
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								},
								{
									"key": "note",
									"title": "Note",
									"type": "text"
								}
							],
							"help_text": "Used to list the machine-readable data file(s) -if any- that served as the source(s) of data.\n- Dataset name: Name (title) of the dataset used as source.\n- URL: Link (URL) to the dataset or to a web page describing the dataset.\n- Note: Additional information on the data source."
						},
						{
							"key": "document_description.reproducibility.statement",
							"title": "Reproducibility statement",
							"type": "text",
							"help_text": "The Reproducibility element is used to provide interested users with information on reproducibility and replicability of the research output. The \"Reproducibility statement\" is a general statement on reproducibility and replicability of the analysis (including data processing, tabulation, production of visualizations, modeling, etc.) being presented in the document."
						},
						{
							"key": "document_description.reproducibility.links",
							"type": "array",
							"title": "Reproducibility links",
							"props": [
								{
									"key": "uri",
									"title": "URL",
									"type": "text"
								},
								{
									"key": "description",
									"title": "Description",
									"type": "text"
								}
							],
							"help_text": "The Reproducibility element is used to provide interested users with information on reproducibility and replicability of the research output. The \"Reproducibility links\" provides links to web pages where reproducible materials and the related information can be found.\n- URL: The link to a web page.\n- Description: A brief description of the content of the web page."
						},
						{
							"key": "document_description.audience",
							"title": "Audience",
							"type": "text",
							"help_text": "Information on the intended audience for the document, i.e. the category or categories of users for whom the resource is intended in terms of their interest, skills, status, or other."
						},
						{
							"key": "document_description.mandate",
							"title": "Mandate",
							"type": "text",
							"help_text": "The legislative or other mandate under which the resource was produced."
						},
						{
							"key": "document_description.relations",
							"title": "Related resources",
							"help_text": "References to related resources.\n- Name: The title or name of the related resource. Recommended practice is to identify the related resource by means of a URI. If this is not possible or feasible, a string conforming to a formal identification system may be provided.\n- Type: The type of relationship. The use of a controlled vocabulary is recommended. The Dublin Core proposes the following vocabulary: {isPartOf, hasPart, isVersionOf, isFormatOf, hasFormat, references, isReferencedBy, isBasedOn, isBasisFor, replaces, isReplacedBy, requires, isRequiredBy}",
							"type": "array",
							"props": [
								{
									"key": "name",
									"title": "Name",
									"type": "string"
								},
								{
									"key": "type",
									"title": "Type",
									"type": "string",
									"enum": []
								}
							]
						}
					],
					"help_text": ""
				},
				{
					"type": "section",
					"key": "document_tags",
					"title": "Tags",
					"class": "recommended",
					"items": [
						{
							"key": "tags",
							"title": "Tags",
							"type": "array",
							"props": [
								{
									"key": "tag_group",
									"title": "Tag group",
									"type": "string"
								},
								{
									"key": "tag",
									"title": "Tag",
									"type": "string"
								}
							]
						}
					]
				}
			]
		}
	]
}